# -*- org-confirm-babel-evaluate: nil; -*-
#+TITLE: Mathematics and Its History
#+OPTIONS: num:nil
#+STARTUP: indent
#+PROPERTY: header-args:axiom :exports results
#+PROPERTY: header-args:latex :results drawer :exports results
#+INFOJS_OPT: view:overview toc:nil

* Initialization

#+BEGIN_SRC axiom :results silent
)clear all
)set output characters default
#+END_SRC

* 1 The Theorem of Pythagoras

** 1.1 Arithmetic and Geometry

(nothing to see here)

** 1.2 Pythagorean Triples

*** Exercises

#+caption: Pairs in Plimpton 322
#+name: fig-1.3
|     a |      c |
|-------+--------|
|   119 |    169 |
|  3367 |   4825 |
|  4601 |   6649 |
| 12709 |  18541 |
|    65 |     97 |
|   319 |    481 |
|  2291 |   3541 |
|   799 |   1249 |
|   481 |    769 |
|  4961 |   8161 |
|    45 |     75 |
|  1679 |   2929 |
|   161 |    289 |
|  1771 |   3229 |
|    56 |    106 |

**** 1.2.1

#+BEGIN_SRC axiom :var pairs=fig-1.3
  bs := map (p +-> sqrt(p.2^2 - p.1^2), pairs) :: List(Integer)
#+END_SRC

#+RESULTS:
#+begin_example
(1) -> pairs := [[119, 169], [3367, 4825], [4601, 6649], [12709, 18541], [65, 97], [319, 481], [2291, 3541], [799, 1249], [481, 769], [4961, 8161], [45, 75], [1679, 2929], [161, 289], [1771, 3229], [56, 106]]

   (1)
   [[119,169], [3367,4825], [4601,6649], [12709,18541], [65,97], [319,481],
    [2291,3541], [799,1249], [481,769], [4961,8161], [45,75], [1679,2929],
    [161,289], [1771,3229], [56,106]]
                                            Type: List(List(PositiveInteger))
(2) -> bs := map (p +-> sqrt(p.2^2 - p.1^2), pairs) :: List(Integer)

   (2)  [120,3456,4800,13500,72,360,2700,960,600,6480,60,2400,240,2700,90]
                                                          Type: List(Integer)

#+end_example

**** 1.2.2

#+BEGIN_SRC axiom
  select (b +-> rem(b,60) ~= 0, bs)
  select (b +-> rem(b,30) ~= 0, %)
  select (b +-> rem(b,12) ~= 0, %)
#+END_SRC

#+RESULTS:
#+begin_example
(3) -> select (b +-> rem(b,60) ~= 0, bs)

   (3)  [3456,72,90]
                                                          Type: List(Integer)
(4) -> select (b +-> rem(b,30) ~= 0, %)

   (4)  [3456,72]
                                                          Type: List(Integer)
(5) -> select (b +-> rem(b,12) ~= 0, %)

   (5)  []
                                                          Type: List(Integer)

#+end_example

**** 1.2.3

#+BEGIN_SRC latex
  Any integer $z$ is of the form $2n$ or $2n+1$ for some integer $n$.
  In the first case, we have
  \begin{align*}
    z^2 &= {(2n)}^2 \\
        &= 4n^2\,,
  \end{align*}
  and in the second,
  \begin{align*}
    z^2 &= {(2n+1)}^2 \\
        &= 4n^2+4n+1 \\
        &= 4(n^2+n)+1\,.
  \end{align*}
#+END_SRC

**** 1.2.4

#+BEGIN_SRC latex
  Suppose indeed that $(a,b,c)$ is a Pythagorean triple and that $a$ and
  $b$ are both odd.  Then there exists $m,n$ such that $a=2m+1$ and
  $b=2n+1$.  But then
  \begin{align*}
    c^2 &= a^2+b^2 \\
        &= {(2m+1)}^2+{(2n+1)}^2 \\
        &= 4m^2+4m+1+4n^2+4n+1 \\
        &= 4(m^2+m+n^2+n)+2\,,
  \end{align*}
  but this contradicts Exercise 1.2.3.
#+END_SRC
